name: "seth_postprocess"
backend: "python"
max_batch_size: 16

input [
  {
    name: "raw_scores"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]  # Raw ONNX model output
  }
]

output [
  {
    name: "disorder_predictions"
    data_type: TYPE_STRING
    dims: [ -1 ]  # Per-residue string labels
  }
]

instance_group [
  {
    count: 1
    kind: KIND_AUTO
  }
]