// Copyright 2025 Tobias Olenyi.
// SPDX-License-Identifier: GPL-3.0-only

{
  "<extra_id_0>": 127,
  "<extra_id_10>": 117,
  "<extra_id_11>": 116,
  "<extra_id_12>": 115,
  "<extra_id_13>": 114,
  "<extra_id_14>": 113,
  "<extra_id_15>": 112,
  "<extra_id_16>": 111,
  "<extra_id_17>": 110,
  "<extra_id_18>": 109,
  "<extra_id_19>": 108,
  "<extra_id_1>": 126,
  "<extra_id_20>": 107,
  "<extra_id_21>": 106,
  "<extra_id_22>": 105,
  "<extra_id_23>": 104,
  "<extra_id_24>": 103,
  "<extra_id_25>": 102,
  "<extra_id_26>": 101,
  "<extra_id_27>": 100,
  "<extra_id_28>": 99,
  "<extra_id_29>": 98,
  "<extra_id_2>": 125,
  "<extra_id_30>": 97,
  "<extra_id_31>": 96,
  "<extra_id_32>": 95,
  "<extra_id_33>": 94,
  "<extra_id_34>": 93,
  "<extra_id_35>": 92,
  "<extra_id_36>": 91,
  "<extra_id_37>": 90,
  "<extra_id_38>": 89,
  "<extra_id_39>": 88,
  "<extra_id_3>": 124,
  "<extra_id_40>": 87,
  "<extra_id_41>": 86,
  "<extra_id_42>": 85,
  "<extra_id_43>": 84,
  "<extra_id_44>": 83,
  "<extra_id_45>": 82,
  "<extra_id_46>": 81,
  "<extra_id_47>": 80,
  "<extra_id_48>": 79,
  "<extra_id_49>": 78,
  "<extra_id_4>": 123,
  "<extra_id_50>": 77,
  "<extra_id_51>": 76,
  "<extra_id_52>": 75,
  "<extra_id_53>": 74,
  "<extra_id_54>": 73,
  "<extra_id_55>": 72,
  "<extra_id_56>": 71,
  "<extra_id_57>": 70,
  "<extra_id_58>": 69,
  "<extra_id_59>": 68,
  "<extra_id_5>": 122,
  "<extra_id_60>": 67,
  "<extra_id_61>": 66,
  "<extra_id_62>": 65,
  "<extra_id_63>": 64,
  "<extra_id_64>": 63,
  "<extra_id_65>": 62,
  "<extra_id_66>": 61,
  "<extra_id_67>": 60,
  "<extra_id_68>": 59,
  "<extra_id_69>": 58,
  "<extra_id_6>": 121,
  "<extra_id_70>": 57,
  "<extra_id_71>": 56,
  "<extra_id_72>": 55,
  "<extra_id_73>": 54,
  "<extra_id_74>": 53,
  "<extra_id_75>": 52,
  "<extra_id_76>": 51,
  "<extra_id_77>": 50,
  "<extra_id_78>": 49,
  "<extra_id_79>": 48,
  "<extra_id_7>": 120,
  "<extra_id_80>": 47,
  "<extra_id_81>": 46,
  "<extra_id_82>": 45,
  "<extra_id_83>": 44,
  "<extra_id_84>": 43,
  "<extra_id_85>": 42,
  "<extra_id_86>": 41,
  "<extra_id_87>": 40,
  "<extra_id_88>": 39,
  "<extra_id_89>": 38,
  "<extra_id_8>": 119,
  "<extra_id_90>": 37,
  "<extra_id_91>": 36,
  "<extra_id_92>": 35,
  "<extra_id_93>": 34,
  "<extra_id_94>": 33,
  "<extra_id_95>": 32,
  "<extra_id_96>": 31,
  "<extra_id_97>": 30,
  "<extra_id_98>": 29,
  "<extra_id_99>": 28,
  "<extra_id_9>": 118
}
