name: "exotox"
platform: "onnxruntime_onnx"
max_batch_size: 0

input [
  {
    name: "X"
    data_type: TYPE_FP32
    dims: [ -1, 1024 ]
  }
]

output [
  {
    name: "label"
    data_type: TYPE_INT64
    dims: [ -1 ]
  },
  {
    name: "probabilities"
    data_type: TYPE_FP32
    dims: [ -1, 2 ]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_AUTO
  }
]
